<<<<<<< HEAD
'''
Написать функцию, которая вычисляет  факториал переданного в нее числа без рекурсии.

'''
n = int(input("Введите число: "))

# def factorial(number):
#     factorial *= i


factorial = 1
for i in range(2, n+1):
    factorial *= i

print(factorial)

=======
'''
Написать функцию, которая вычисляет  факториал переданного в нее числа без рекурсии.

'''
n = int(input("Введите число: "))

# def factorial(number):
#     factorial *= i


factorial = 1
for i in range(2, n+1):
    factorial *= i

print(factorial)

>>>>>>> d64038ef74ba144a6ff00af923ff1a20353ae745
