<<<<<<< HEAD
'''
Написать функцию, которая возвращает любое число в виде денежной величины 
с разделителями групп разрядов в качестве пробела и валютой в конце. 
Денежная величина всегда должна содержать количество копеек в виде дух 
знаков после точки, даже если исходное число целое. 
*Нельзя использовать форматную строку.
Например: 1234567 -> "1 234 567.00 руб."

с помощью try перехватить возможные ошибки.
'''

a = int(input("Введите число: "))


def b(money):
    return '{:,.2f} руб.'.format(money)


=======
'''
Написать функцию, которая возвращает любое число в виде денежной величины 
с разделителями групп разрядов в качестве пробела и валютой в конце. 
Денежная величина всегда должна содержать количество копеек в виде дух 
знаков после точки, даже если исходное число целое. 
*Нельзя использовать форматную строку.
Например: 1234567 -> "1 234 567.00 руб."

с помощью try перехватить возможные ошибки.
'''

a = int(input("Введите число: "))


def b(money):
    return '{:,.2f} руб.'.format(money)


>>>>>>> d64038ef74ba144a6ff00af923ff1a20353ae745
print(b(a))