# a = input("Введите фразу: ")
# print("Количество символов: ", len(a))
# print("Количество слов: ", len(a.split()))



# a = input("Введите 3 цифры: ")
# print(int(a[0]) + int(a[2]) + int(a[4]))


# a = input()
# print(a[::-1])


# s = "имя: Дмитрий, фамилия: Иванов, возраст: 18"
# s = s.replace('.','').split()
# w1 = s[1]
# w2 = s[3]
# w3 = s[5]
# print(" - " + w1, '\n', "- " + w2, '\n', "- " + w3)


# a = input("Введите имя: ")
# print(f"Юзер с именем {a} заходил на сайт в 15:00")


# a = "Это тестовая <start>строка для изучения<end> строковых операци"
# b = a.split("<start>")[-1]
# c = b.split("<end>")[0]
# print(c) 

# import re
# a = "Это тестовая <start>строка для изучения<end> строковых операци"
# b = re.split('[><]', a)
# print(b[2])