<<<<<<< HEAD
"""
Запросить у учителя оценки ученика до тех пор пока он не введет 0. 
Выдать средний бал ученика.
"""
bal = 0
sum_bal = 0
a = int(input("Вводим оценки ученика: "))
while a != 0:
    if 0 < a <= 10:
        sum_bal += a
        bal += 1
        a = int(input("Вводим оценки ученика: "))
    else:
        print("Это не оценка")   
sr_bal = sum_bal/bal
=======
"""
Запросить у учителя оценки ученика до тех пор пока он не введет 0. 
Выдать средний бал ученика.
"""
bal = 0
sum_bal = 0
a = int(input("Вводим оценки ученика: "))
while a != 0:
    if 0 < a <= 10:
        sum_bal += a
        bal += 1
        a = int(input("Вводим оценки ученика: "))
    else:
        print("Это не оценка")   
sr_bal = sum_bal/bal
>>>>>>> d64038ef74ba144a6ff00af923ff1a20353ae745
print("Средний бал ученика: ", sr_bal)