<<<<<<< HEAD
a = int(input('Введите число от 1 до 12:'))
b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]
c = ['Январь', "Февраль", "Март", "Апрель", "Май", "Июнь", "Июль", "Август", "Сентябрь", "Октябрь", "Ноябрь", "Декабрь"]
d = ["Зима", "Зима", "Весна", "Весна", "Весна", "Лето", "Лето", "Лето", "Осень", "Осень", "Осень", "Зима"]
e = ["31 день", "28 дней","31 день", "30 дней", "31 день", "30 дней", "31 день", "31 день", "30 дней", "31 день", "30 дней", "31 день",]

w = dict(zip(b,c))
w1 = dict(zip(b,d))
w2 = dict(zip(b,e))

if a >0  and a <= 12:
    print(w[a], w1[a], w2[a])
    
else:
=======
a = int(input('Введите число от 1 до 12:'))
b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]
c = ['Январь', "Февраль", "Март", "Апрель", "Май", "Июнь", "Июль", "Август", "Сентябрь", "Октябрь", "Ноябрь", "Декабрь"]
d = ["Зима", "Зима", "Весна", "Весна", "Весна", "Лето", "Лето", "Лето", "Осень", "Осень", "Осень", "Зима"]
e = ["31 день", "28 дней","31 день", "30 дней", "31 день", "30 дней", "31 день", "31 день", "30 дней", "31 день", "30 дней", "31 день",]

w = dict(zip(b,c))
w1 = dict(zip(b,d))
w2 = dict(zip(b,e))

if a >0  and a <= 12:
    print(w[a], w1[a], w2[a])
    
else:
>>>>>>> d64038ef74ba144a6ff00af923ff1a20353ae745
    print('Не верное число')